In [59]:
import pandas as pd

# Part 1: Sales and Profitability Analysis

In [60]:
o1 = pd.read_csv('054D3868.csv')
o2 = pd.read_csv('A20E12A1.csv')
o3 = pd.read_csv('BE370689.csv')

In [61]:
display(o1.head())
display(o2.head())
display(o3.head())

  Order ID  Order Date CustomerName           State       City
0  B-25601  01-04-2018       Bharat         Gujarat  Ahmedabad
1  B-25602  01-04-2018        Pearl     Maharashtra       Pune
2  B-25603  03-04-2018        Jahan  Madhya Pradesh     Bhopal
3  B-25604  03-04-2018       Divsha       Rajasthan     Jaipur
4  B-25605  05-04-2018      Kasheen     West Bengal    Kolkata

  Month of Order Date   Category   Target
0              Apr-18  Furniture  10400.0
1              May-18  Furniture  10500.0
2              Jun-18  Furniture  10600.0
3              Jul-18  Furniture  10800.0
4              Aug-18  Furniture  10900.0

  Order ID  Amount  Profit  Quantity     Category      Sub-Category
0  B-25601  1275.0 -1148.0         7    Furniture         Bookcases
1  B-25601    66.0   -12.0         5     Clothing             Stole
2  B-25601     8.0    -2.0         3     Clothing       Hankerchief
3  B-25601    80.0   -56.0         4  Electronics  Electronic Games
4  B-25602   168.0  -111.0         2  Electronics            Phones

In [62]:
display(o1.isna().sum())
display(o1.shape)
display(o2.isna().sum())
display(o2.shape)
display(o3.isna().sum())
display(o3.shape)

Order ID        60
Order Date      60
CustomerName    60
State           60
City            60
dtype: int64

(560, 5)

Month of Order Date    0
Category               0
Target                 0
dtype: int64

(36, 3)

Order ID        0
Amount          0
Profit          0
Quantity        0
Category        0
Sub-Category    0
dtype: int64

(1500, 6)

In [63]:
o1 = o1[~o1.City.isna()]

In [64]:
o1.isna().sum()

Order ID        0
Order Date      0
CustomerName    0
State           0
City            0
dtype: int64

***q1***

In [65]:
final_o = pd.merge(o1,o3, how='left', on='Order ID')
final_o.head()

,Order ID,Order Date,CustomerName,State,City,Amount,Profit,Quantity,Category,Sub-Category
0,B-25601,01-04-2018,Bharat,Gujarat,Ahmedabad,1275.0,-1148.0,7,Furniture,Bookcases
1,B-25601,01-04-2018,Bharat,Gujarat,Ahmedabad,66.0,-12.0,5,Clothing,Stole
2,B-25601,01-04-2018,Bharat,Gujarat,Ahmedabad,8.0,-2.0,3,Clothing,Hankerchief
3,B-25601,01-04-2018,Bharat,Gujarat,Ahmedabad,80.0,-56.0,4,Electronics,Electronic Games
4,B-25602,01-04-2018,Pearl,Maharashtra,Pune,168.0,-111.0,2,Electronics,Phones

**q1 final answer**

In [66]:
category_sales = final_o.groupby('Category')['Amount'].sum().reset_index().rename(columns={'Amount': 'Total Sales'})
category_sales['Total Sales']=category_sales['Total Sales'].astype(int)
category_sales.head()

      Category  Total Sales
0     Clothing       139054
1  Electronics       165267
2    Furniture       127181

***q2***

In [67]:
group = final_o.groupby('Category').agg(
    total_profit=('Profit', 'sum'),
    total_amount=('Amount', 'sum')
).reset_index()

temp_df = final_o.groupby(['Order ID','Category'])['Profit'].sum().reset_index()
temp_df = temp_df.groupby('Category')['Profit'].mean().reset_index()

display(group.head())
display(temp_df.head())

      Category  total_profit  total_amount
0     Clothing       11163.0      139054.0
1  Electronics       10494.0      165267.0
2    Furniture        2298.0      127181.0

      Category     Profit
0     Clothing  28.404580
1  Electronics  51.441176
2    Furniture  12.354839

In [68]:
final_df = pd.merge(group,temp_df, how='left',on='Category')
final_df.rename({'Profit':'avg_profit_per_order'},inplace=True, axis=1)
final_df.head()

      Category  total_profit  total_amount  avg_profit_per_order
0     Clothing       11163.0      139054.0             28.404580
1  Electronics       10494.0      165267.0             51.441176
2    Furniture        2298.0      127181.0             12.354839

In [69]:
final_df['total_profit_mergin'] = (final_df['total_profit'] / final_df['total_amount'])*100

**q2 final answer**

In [70]:
final_df[['Category','avg_profit_per_order','total_profit_mergin']]

      Category  avg_profit_per_order  total_profit_mergin
0     Clothing             28.404580             8.027817
1  Electronics             51.441176             6.349725
2    Furniture             12.354839             1.806874

<h3>I think amount is the net profit and from that perspective I use the formula for total_profit_mergin<h3/>

***q3***

<h2>based on above metrix I get below information<h2/>

**q3 final answer**

### ✅ Category Ranking

**From highest to lowest average profit per order:**
- **Electronics → Clothing → Furniture**

**From highest to lowest total profit margin:**
- **Clothing → Electronics → Furniture**

### 📉 Underperforming Category: `Furniture`

- **Possible Reasons:**
  - High logistics/shipping costs eating into profit
  - Returns or damages reducing profitability

### 📈 Top-performing Category: `Clothing and electronics`
- **Possbile Reason:**
    - High demand in the market
    - Customer satisfaction

# Part 2: Target Achievement Analysis

**q1**